# 16. 데이터를 추출하는 다양한 방법
## 16-1. [ ] 이용하기

### (p.383) 조건을 충족하는 행 추출하기

In [2]:
import pandas as pd
import os

In [4]:
os.chdir('C:\\Users\\user\\Documents\\GitHub\\Doit_Python\\Data')
os.getcwd()

'C:\\Users\\user\\Documents\\GitHub\\Doit_Python\\Data'

In [6]:
df_raw = pd.read_csv('exam.csv')

In [7]:
df = df_raw.head(10)
df

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [9]:
df['nclass']

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [10]:
df['nclass'] == 1

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: nclass, dtype: bool

In [12]:
df[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [14]:
df[df['math'] >=80]

   id  nclass  math  english  science
6   7       2    80       90       45
7   8       2    90       78       25

In [16]:
df[(df['nclass'] == 1) & (df['math'] >= 50)]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60

In [17]:
df[(df['math'] < 50) | (df['english'] < 50)]

   id  nclass  math  english  science
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
8   9       3    20       98       15

### (p386) 열 추출하기

In [18]:
df['id']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: id, dtype: int64

In [19]:
df['nclass']

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [20]:
df[['id', 'nclass']]

   id  nclass
0   1       1
1   2       1
2   3       1
3   4       1
4   5       2
5   6       2
6   7       2
7   8       2
8   9       3
9  10       3

In [21]:
df[['id']]

   id
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [23]:
df['math']

0    50
1    60
2    45
3    30
4    25
5    50
6    80
7    90
8    20
9    50
Name: math, dtype: int64

In [24]:
df.math

0    50
1    60
2    45
3    30
4    25
5    50
6    80
7    90
8    20
9    50
Name: math, dtype: int64

In [25]:
df['math'].mean()

50.0

In [26]:
df.math.mean()

50.0

### (p.388) 조건을 충족하는 행에서 열 추출하기

In [28]:
df[df['nclass'] == 1]['math']

0    50
1    60
2    45
3    30
Name: math, dtype: int64

In [32]:
df[df['nclass'] == 1][['math']]

   math
0    50
1    60
2    45
3    30

In [33]:
df[df['nclass'] == 1][['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

In [35]:
df.groupby('nclass').agg(mean_math    = ('math', 'mean'),
                         mean_english = ('english', 'mean'))

        mean_math  mean_english
nclass
1           46.25         94.75
2           61.25         84.25
3           35.00         98.00

In [36]:
df.groupby('nclass', as_index = False).agg(mean_math    = ('math', 'mean'),
                                           mean_english = ('english', 'mean'))

   nclass  mean_math  mean_english
0       1      46.25         94.75
1       2      61.25         84.25
2       3      35.00         98.00

In [37]:
df.groupby('nclass')[['math', 'english']].mean()

         math  english
nclass
1       46.25    94.75
2       61.25    84.25
3       35.00    98.00

## 16-2. df.loc[ ] 이용하기
### (p.390) 인덱스 활용하기

In [38]:
df = pd.DataFrame({'var1' : [1, 2, 3],
                   'var2' : [4, 5, 6]})
df

   var1  var2
0     1     4
1     2     5
2     3     6

In [40]:
df = pd.DataFrame({'var1' : [1, 2, 3],
                   'var2' : [4, 5, 6]},
                  index = ['kim', 'lee', 'park'])
df

      var1  var2
kim      1     4
lee      2     5
park     3     6

### (p.391) 인덱스 문자열을 지정해 행 추출하기

In [41]:
df.loc['kim']

var1    1
var2    4
Name: kim, dtype: int64

In [42]:
df.loc[['kim', 'park']]

      var1  var2
kim      1     4
park     3     6

### (p.391) 인덱스 문자열을 지정해 열 추출하기

In [43]:
df.loc['lee', 'var1']

2

In [44]:
df.loc[['kim', 'lee'], 'var2']

kim    4
lee    5
Name: var2, dtype: int64

In [46]:
df.loc[['kim', 'lee'], ['var1', 'var2']]

     var1  var2
kim     1     4
lee     2     5

In [47]:
df.loc[:, 'var1']

kim     1
lee     2
park    3
Name: var1, dtype: int64

In [48]:
df = df_raw.copy()

In [60]:
df = df.head(10)

In [63]:
df.shape

(10, 5)

In [64]:
df.loc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [65]:
df.loc[2]

id          3
nclass      1
math       45
english    86
science    78
Name: 2, dtype: int64

In [66]:
df.loc[[0]]

   id  nclass  math  english  science
0   1       1    50       98       50

In [67]:
df.loc[[0, 3, 5]]

   id  nclass  math  english  science
0   1       1    50       98       50
3   4       1    30       98       58
5   6       2    50       89       98

In [68]:
df.loc[0:3]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [69]:
df.loc[7:9]

   id  nclass  math  english  science
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [70]:
df.loc[0:2]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

In [71]:
df.loc[:2]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

In [72]:
df.loc[5:9]

   id  nclass  math  english  science
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [73]:
df.loc[5:]

   id  nclass  math  english  science
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [74]:
df.loc[:]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [75]:
df

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [76]:
df_label = pd.DataFrame({'var1' : [1, 2, 3],
                         'var2' : [4, 5, 6]},
                         index = ['kim', 'lee', 'park'])
df_label

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [81]:
# df_label.loc[0]  # Error
df_label.loc['kim']

var1    1
var2    4
Name: kim, dtype: int64

In [82]:
df.loc[2, :]

id          3
nclass      1
math       45
english    86
science    78
Name: 2, dtype: int64

In [ ]:
# df.loc[:, 2]   # Error

### (p.397) 조건을 충족하는 행 추출하기

In [84]:
df.loc[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [85]:
df.loc[df['math'] >= 60]

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

In [87]:
df.loc[df['nclass'] == 1, ['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

In [90]:
df[df['nclass'] == 1][['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

In [88]:
df.loc[0:3, 'math']

0    50
1    60
2    45
3    30
Name: math, dtype: int64

In [92]:
df.query('math > 50')

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

In [95]:
df.loc[df['math'] > 50]

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

In [96]:
df[df['math'] > 50]

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

## 16-2. df.iloc[ ] 이용하기
### (p.399) 인덱스 번호를 지정해 행 추출하기

In [97]:
df.iloc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [98]:
df.loc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [99]:
df.iloc[2]

id          3
nclass      1
math       45
english    86
science    78
Name: 2, dtype: int64

In [100]:
df.iloc[[0]]

   id  nclass  math  english  science
0   1       1    50       98       50

In [101]:
df.iloc[[0, 3, 5]]

   id  nclass  math  english  science
0   1       1    50       98       50
3   4       1    30       98       58
5   6       2    50       89       98

In [102]:
df.iloc[[0, 5, 3]]

   id  nclass  math  english  science
0   1       1    50       98       50
5   6       2    50       89       98
3   4       1    30       98       58

In [103]:
df.loc[1:5]

   id  nclass  math  english  science
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98

In [104]:
df.iloc[1:5]

   id  nclass  math  english  science
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [105]:
df_label

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [109]:
# df_label.loc[0]   # Error
df_label.iloc[0]

var1    1
var2    4
Name: kim, dtype: int64

### (p.402) 인덱스 번호를 지정해 열 추출하기

In [111]:
# df.loc[:, 1]     # Error
df.iloc[:, 1]

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [114]:
df.iloc[:, [1, 3]]

   nclass  english
0       1       98
1       1       97
2       1       86
3       1       98
4       2       80
5       2       89
6       2       90
7       2       78
8       3       98
9       3       98

In [115]:
df.iloc[2, 3]

86

In [117]:
df.iloc[[0, 1], [1, 2, 3]]

   nclass  math  english
0       1    50       98
1       1    60       97

In [135]:
# df.iloc[df['nclass'] == 1]    # Error
df.loc[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58